Repository: Hynox-org/blindly-dating-app
Catalog: lib/l10n/intl_*.arb
Languages: ta

# welcomeTagline
source: Real connections start here!
ta: உண்மையான தொடர்புகள் இங்கே தொடங்குகின்றன!

# createAccount
source: Create an account
ta: அக்கவுண்ட் உருவாக்கு

# haveAccount
source: I have an account
ta: எனக்கு அக்கவுண்ட் உள்ளது

source: By signing up,
ta: பதிவு செய்வதன் மூலம்,

# termsAgreement
source: you agree to our terms
ta: எங்கள் நிபந்தனைகளை நீங்கள் ஏற்கிறீர்கள்

# dataUsage
source: See how we use your
ta: உங்கள் தரவை எவ்வாறு பயன்படுத்துகிறோம் என்பதை

source: privacy policy
ta: தனியுரிமைக் கொள்கையில் பார்க்கவும்

# termsTitle
source: Community guidelines
ta: கம்யூனிட்டி வழிமுறைகள்

# termsIntro
source: Welcome to our community! To ensure safe and positive experience for every one, we ask that you follow simple guidelines.
ta: எங்கள் சமூகத்திற்கு வரவேற்கிறோம்! அனைவருக்கும் பாதுகாப்பாகவும் நல்ல அனுபவமாகவும் இருக்க, சில எளிய வழிமுறைகளைப் பின்பற்றும்படி கேட்டுக்கொள்கிறோம்.

# termsBox1Title
source: Be kind and respectful
ta: அன்பாகவும் மரியாதையுடனும் இருங்கள்

# termsBox1Body
source: Treat others as you would like to be treated. We're all in together to create welcoming environment.
ta: நீங்கள் எப்படி நடத்தப்பட விரும்புகிறீர்களோ, மற்றவர்களையும் அப்படியே நடத்துங்கள். நாம் அனைவரும் சேர்ந்து வரவேற்பான சூழலை உருவாக்குகிறோம்.

# termsBox2Title
source: Stay authentic
ta: உண்மையானவராக இருங்கள்

# termsBox2Body
source: Be genuine in your profile and interactions. We value authenticity and real connections.
ta: உங்கள் புரொஃபைலும் உரையாடல்களும் நேர்மையாக இருக்கட்டும். உண்மைத்தன்மையும் உண்மையான தொடர்புகளையும் நாங்கள் மதிக்கிறோம்.

# termsBox3Title
source: Prioritize safety
ta: பாதுகாப்புக்கு முன்னுரிமை கொடுங்கள்

# termsBox3Body
source: Do not share sensitive and personal information. Protect your self and others in the community.
ta: சென்சிட்டிவ் அல்லது தனிப்பட்ட தகவல்களை பகிர வேண்டாம். உங்களையும் சமூகத்தில் உள்ள மற்றவர்களையும் பாதுகாத்துக் கொள்ளுங்கள்.

# termsBox4Title
source: No hate speech
ta: வெறுப்பு பேச்சு வேண்டாம்

# termsBox4Body
source: Harassment, bullying and illegal contents are not tolerate here. Help us keep in community safe.
ta: துன்புறுத்தல், பலியிங் அல்லது சட்டவிரோத உள்ளடக்கம் எதுவும் அனுமதிக்கப்படாது. சமூகத்தை பாதுகாப்பாக வைத்திருக்க எங்களுக்கு உதவுங்கள்.

# termsBox5Title
source: Help keep us safe
ta: எங்களை பாதுகாப்பாக வைக்க உதவுங்கள்

# termsBox5Body
source: If you see something that violate our guideline. Please report it. Your help is invaluable.
ta: எங்கள் வழிமுறைகளை மீறும் எதையாவது நீங்கள் கண்டால், தயவுசெய்து அறிக்கையிடுங்கள். உங்கள் உதவி மிக மதிப்புமிக்கது.

# termsBox6Title
source: Date with genuine intentions
ta: உண்மையான நோக்கத்துடன் தொடர்பு கொள்ளுங்கள்

# termsBox6Body
source: We're here for real connections. We don't allow catfish or coercion. We don't allow scams, impersonation, or any kind of manipulation for personal or financial gain.
ta: இங்கே உண்மையான தொடர்புகளுக்காகவே இருக்கிறோம். கேட்ஃபிஷிங், வற்புறுத்தல், மோசடி, போலிவேடம் அல்லது எந்தவிதமான சூழ்ச்சி/ஏமாற்றும் அனுமதிக்கப்படாது.

# termsBox7Title
source: Adults only
ta: வயது வரம்பு – பெரியவர்கள் மட்டும்

# termsBox7Body
source: You must be 18 years of age or older to use Blindly. This also means we don't allow photos of unaccompanied or unclothed minors, including photos of your younger self--no matter how adorable you were back then.
ta: Blindly ஐப் பயன்படுத்த நீங்கள் குறைந்தது 18 வயது அல்லது அதற்கு மேற்பட்டவராக இருக்க வேண்டும். காவலரில்லாத அல்லது ஆடையில்லாத சிறுவர்கள் பற்றிய புகைப்படங்கள் (உங்கள் சிறுவயது புகைப்படங்களையும்) எந்தவை கூட அனுமதிக்கப்படமாட்டாது.

# termsAgreeButton
source: Agree & Continue
ta: ஏற்கிறேன் & தொடர்கிறேன்

# termsFooterPrefix
source: By Continue, you agree to our
ta: தொடருவதன் மூலம், நீங்கள் எங்கள்

# termsFooterTerms
source: terms
ta: விதிமுறைகளுக்கு

# termsFooterMiddle
source: . See how we use your data in our
ta: சம்மதிக்கிறீர்கள். உங்கள் தரவை எவ்வாறு பயன்படுத்துகிறோம் என்பதை எங்கள்

# termsFooterPrivacy
source: privacy policy
ta: தனியுரிமைக் கொள்கையில்

# ageTitle
source: What's your age?
ta: உங்கள் வயது என்ன?

# ageSubtitle
source: This help us show you relevant age profiles and find your matches
ta: உங்களுக்கு பொருத்தமான வயது குழு ப்ரொஃபைல்களை காட்டி, சரியான பொருத்தங்களை கண்டுபிடிக்க இதை பயன்படுத்துகிறோம்.

# ageRange1
source: Age: 20-23
ta: வயது: 20-23

# ageRange2
source: Age: 24-27
ta: வயது: 24-27

# ageRange3
source: Age: 28-32
ta: வயது: 28-32

# ageRange4
source: Age: 32-38
ta: வயது: 32-38

# ageSelectError
source: Please select your age range
ta: தயவுசெய்து உங்கள் வயது வரம்பைத் தேர்வு செய்யவும்

# ageContinue
source: Continue
ta: தொடரவும்

# authSelectionTitle
source: Login to a Lovely life
ta: அழகான வாழ்க்கைக்குள் நுழையுங்கள்

# authSelectionApple
source: Continue with Apple
ta: Apple மூலம் தொடரவும்

# authSelectionGoogle
source: Continue with Google
ta: Google மூலம் தொடரவும்

# authSelectionPhone
source: Continue with Mobile number
ta: மொபைல் எண்ணுடன் தொடரவும்

# authSelectionFooterPrefix
source: By signing up, you agree to our
ta: சைன் அப் செய்வதன் மூலம், நீங்கள் எங்கள்

# authSelectionFooterTerms
source: terms
ta: விதிமுறைகளுக்கு

# authSelectionFooterMiddle
source: . See how we use your data in our
ta: சம்மதிக்கிறீர்கள். உங்கள் தரவை எவ்வாறு பயன்படுத்துகிறோம் என்பதை எங்கள்

# authSelectionFooterPrivacy
source: privacy policy
ta: தனியுரிமைக் கொள்கையில்

# authGoogleFailed
source: Google Sign-In failed
ta: Google உள்நுழைவு தோல்வியடைந்தது: {0}

# authPhoneInfo
source: We only use phone numbers to make sure everyone on Blindly is real
ta: Blindlyயில் அனைவரும் உண்மையானவர்களா என்பதை உறுதிப்படுத்த மட்டுமே உங்கள் தொலைபேசி எண்ணைப் பயன்படுத்துகிறோம்.

# authPhoneCountry
source: Country
ta: நாடு

# authPhoneNumber
source: Phone number
ta: தொலைபேசி எண்

# authPhoneHint
source: e.g. 9876543210
ta: உதா. 9876543210

# authPhoneFooterPrefix
source: By continuing, you agree to our
ta: தொடருவதன் மூலம், நீங்கள் எங்கள்

# authPhoneFooterTerms
source: terms
ta: விதிமுறைகளுக்கு

# authPhoneFooterMiddle
source: . See how we use your data in our
ta: சம்மதிக்கிறீர்கள். உங்கள் தரவை எவ்வாறு பயன்படுத்துகிறோம் என்பதை எங்கள்

# authPhoneFooterPrivacy
source: privacy policy
ta: தனியுரிமைக் கொள்கையில்

# authPhoneContinue
source: Continue
ta: தொடரவும்

# authPhoneInvalid
source: Please enter a valid phone number
ta: சரியான தொலைபேசி எண்ணை உள்ளிடுங்கள்

# authPhoneEnterNumber
source: Please enter your phone number
ta: உங்கள் தொலைபேசி எண்ணை உள்ளிடவும்

# authPhoneDigitsOnly
source: Phone number must contain only digits
ta: தொலைபேசி எண்ணில் எண்கள் மட்டுமே இருக்க வேண்டும்

# authPhoneInvalidIndia
source: Please enter a valid 10-digit Indian phone number starting with 6-9
ta: 6-9 உடன் தொடங்கும் 10 இலக்க தொலைபேசி எண்ணை உள்ளிடவும்

# authPhoneInvalidUs
source: Please enter a valid 10-digit phone number
ta: சரியான 10 இலக்க தொலைபேசி எண்ணை உள்ளிடவும்

# authOtpIncomplete
source: Please enter complete OTP
ta: முழு OTP ஐ உள்ளிடவும்

# authFieldsEmpty
source: Please fill all fields
ta: அனைத்து கள்களையும் நிரப்பவும்

# authEmailInvalid
source: Please enter a valid email address
ta: சரியான மின்னஞ்சல் முகவரியை உள்ளிடவும்

# authPasswordShort
source: Password must be at least 6 characters
ta: கடவுச்சொல் குறைந்தது 6 எழுத்துகள் இருக்க வேண்டும்

# authProfileFailed
source: Failed to create profile: {error}
ta: புரோஃபைல் உருவாக்கம் தோல்வியடைந்தது: {error}

# authVerifyFailed
source: Verification failed: {error}
ta: சரிபார்ப்பு தோல்வியடைந்தது: {error}

# authLoginFailed
source: Login failed: {error}
ta: உள்நுழைவு தோல்வியடைந்தது: {error}

# authPhoneOtpHint
source: Enter the code we've sent by text to {phone}.
ta: {phone} என்ற எண்ணிற்கு அனுப்பிய குறியீட்டை உள்ளிடுங்கள்.

# authPhoneOtpChangeNumber
source: Change number
ta: எண்ணை மாற்றவும்

# authOtpResend
source: Resend code
ta: குறியீட்டை மீண்டும் அனுப்பு

# authOtpCountdown
source: The code should arrive within {seconds}s
ta: குறியீடு {seconds} விநாடிகளுக்குள் வர வேண்டும்

# authOtpContinue
source: Continue
ta: தொடரவும்

# authEmailIntro
source: Please enter your login details below
ta: உங்கள் உள்நுழைவு விவரங்களை கீழே உள்ளிடுங்கள்

# authEmailLabel
source: Email
ta: மின்னஞ்சல்

# authPasswordLabel
source: Password
ta: கடவுச்சொல்

# authForgotPassword
source: Forgot your password?
ta: கடவுச்சொல்லை மறந்துவிட்டீர்களா?

# authEmailFooterPrefix
source: By continuing, you agree to our
ta: தொடருவதன் மூலம், நீங்கள் எங்கள்

# authEmailFooterTerms
source: terms
ta: விதிமுறைகளுக்கு

# authEmailFooterMiddle
source: . See how we use your data in our
ta: சம்மதிக்கிறீர்கள். உங்கள் தரவை எவ்வாறு பயன்படுத்துகிறோம் என்பதை எங்கள்

# authEmailFooterPrivacy
source: privacy policy
ta: தனியுரிமைக் கொள்கையில்

# authEmailContinue
source: Continue
ta: தொடரவும்

# authEmailOtpHint
source: Enter the code we've sent by email to {email}.
ta: {email} முகவரிக்கு அனுப்பிய குறியீட்டை உள்ளிடுங்கள்.

# authEmailOtpChangeEmail
source: Change email
ta: மின்னஞ்சலை மாற்றவும்

# authAppleIntro
source: Please enter your login details below
ta: உங்கள் உள்நுழைவு விவரங்களை கீழே உள்ளிடுங்கள்

# authAppleEmailLabel
source: Email
ta: மின்னஞ்சல்

# authApplePasswordLabel
source: Password
ta: கடவுச்சொல்

# authAppleForgotPassword
source: Forgot your password?
ta: கடவுச்சொல்லை மறந்துவிட்டீர்களா?

# authAppleFooterPrefix
source: By continuing, you agree to our
ta: தொடருவதன் மூலம், நீங்கள் எங்கள்

# authAppleFooterTerms
source: terms
ta: விதிமுறைகளுக்கு

# authAppleFooterMiddle
source: . See how we use your data in our
ta: சம்மதிக்கிறீர்கள். உங்கள் தரவை எவ்வாறு பயன்படுத்துகிறோம் என்பதை எங்கள்

# authAppleFooterPrivacy
source: privacy policy
ta: தனியுரிமைக் கொள்கையில்

# authAppleContinue
source: Continue
ta: தொடரவும்

# authTitlePhone
source: Can I get your number?
ta: உங்கள் எண்ணைப் பெறலாமா?

# authTitlePhoneOtp
source: Verify your number
ta: உங்கள் எண்ணைச் சரிபார்க்கவும்

# authTitleEmail
source: Login with Gmail
ta: Gmail உடன் உள்நுழையவும்

# authTitleEmailOtp
source: Verify your google
ta: உங்கள் Google ஐ சரிபார்க்கவும்

# authTitleApple
source: Login with Apple
ta: Apple உடன் உள்நுழையவும்
